Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.10.230/samv71b/atdf/ATSAMV71J20B.atdf
      <value-group caption="" name="SUPC_WUIR__WKUPT11">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT12">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT13">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPS">
        <value caption="No wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMWS">
        <value caption="No wake-up due to a supply monitor detection has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one wake-up due to a supply monitor detection has occurred since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__BODRSTS">
        <value caption="No core brownout rising edge event has been detected since the last read of the SUPC_SR." name="NO" value="0"/>
        <value caption="At least one brownout output rising edge event has been detected since the last read of the SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMRSTS">
        <value caption="No supply monitor detection has generated a core reset since the last read of the SUPC_SR." name="NO" value="0"/>
        <value caption="At least one supply monitor detection has generated a core reset since the last read of the SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMS">
        <value caption="No supply monitor detection since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one supply monitor detection since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMOS">
        <value caption="The supply monitor detected VDDIO higher than its threshold at its last measurement." name="HIGH" value="0"/>
        <value caption="The supply monitor detected VDDIO lower than its threshold at its last measurement." name="LOW" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__OSCSEL">
        <value caption="The slow clock, SLCK, is generated by the embedded 32 kHz RC oscillator." name="RC" value="0"/>
        <value caption="The slow clock, SLCK, is generated by the 32 kHz crystal oscillator." name="CRYST" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__LPDBCS0">
        <value caption="No wake-up due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one wake-up due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__LPDBCS1">
        <value caption="No wake-up due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one wake-up due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS0">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS1">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS2">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS3">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
