Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.10.230/samv71b/atdf/ATSAMV71J20B.atdf
        <register caption="Receiver Timeout Register" name="US_RTOR" offset="0x0024" rw="RW" size="4">
          <bitfield caption="Timeout Value" mask="0x0001FFFF" name="TO"/>
        </register>
        <register caption="Transmitter Timeguard Register" name="US_TTGR" offset="0x0028" rw="RW" size="4">
          <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
          <mode name="LON" caption="LON" qualifier="US_MR.USART_MODE"/>
          <bitfield modes="USART" caption="Timeguard Value" mask="0x000000FF" name="TG"/>
          <bitfield modes="LON" caption="LON PCYCLE Length" mask="0x00FFFFFF" name="PCYCLE"/>
        </register>
        <register caption="FI DI Ratio Register" name="US_FIDI" offset="0x0040" rw="RW" size="4">
          <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
          <mode name="LON" caption="LON" qualifier="US_MR.USART_MODE"/>
          <bitfield modes="USART" caption="FI Over DI Ratio Value" mask="0x0000FFFF" name="FI_DI_RATIO"/>
          <bitfield modes="LON" caption="LON BETA2 Length" mask="0x00FFFFFF" name="BETA2"/>
        </register>
        <register caption="Number of Errors Register" name="US_NER" offset="0x0044" rw="R" size="4">
          <bitfield caption="Number of Errors" mask="0x000000FF" name="NB_ERRORS"/>
        </register>
        <register caption="IrDA Filter Register" name="US_IF" offset="0x004C" rw="RW" size="4">
          <bitfield caption="IrDA Filter" mask="0x000000FF" name="IRDA_FILTER"/>
        </register>
        <register caption="Manchester Configuration Register" name="US_MAN" offset="0x0050" rw="RW" size="4">
          <bitfield caption="Transmitter Preamble Length" mask="0x0000000F" name="TX_PL"/>
          <bitfield caption="Transmitter Preamble Pattern" mask="0x00000300" name="TX_PP" values="US_MAN__TX_PP"/>
          <bitfield caption="Transmitter Manchester Polarity" mask="0x00001000" name="TX_MPOL"/>
          <bitfield caption="Receiver Preamble Length" mask="0x000F0000" name="RX_PL"/>
          <bitfield caption="Receiver Preamble Pattern detected" mask="0x03000000" name="RX_PP" values="US_MAN__RX_PP"/>
          <bitfield caption="Receiver Manchester Polarity" mask="0x10000000" name="RX_MPOL"/>
          <bitfield caption="Must Be Set to 1" mask="0x20000000" name="ONE"/>
          <bitfield caption="Drift Compensation" mask="0x40000000" name="DRIFT"/>
          <bitfield caption="Receiver Idle Value" mask="0x80000000" name="RXIDLEV"/>
        </register>
        <register caption="LIN Mode Register" name="US_LINMR" offset="0x0054" rw="RW" size="4">
          <bitfield caption="LIN Node Action" mask="0x00000003" name="NACT" values="US_LINMR__NACT"/>
          <bitfield caption="Parity Disable" mask="0x00000004" name="PARDIS"/>
          <bitfield caption="Checksum Disable" mask="0x00000008" name="CHKDIS"/>
          <bitfield caption="Checksum Type" mask="0x00000010" name="CHKTYP"/>
          <bitfield caption="Data Length Mode" mask="0x00000020" name="DLM"/>
          <bitfield caption="Frame Slot Mode Disable" mask="0x00000040" name="FSDIS"/>
          <bitfield caption="Wakeup Signal Type" mask="0x00000080" name="WKUPTYP"/>
          <bitfield caption="Data Length Control" mask="0x0000FF00" name="DLC"/>
          <bitfield caption="DMAC Mode" mask="0x00010000" name="PDCM"/>
          <bitfield caption="Synchronization Disable" mask="0x00020000" name="SYNCDIS"/>
        </register>
        <register caption="LIN Identifier Register" name="US_LINIR" offset="0x0058" rw="RW" size="4">
          <bitfield caption="Identifier Character" mask="0x000000FF" name="IDCHR"/>
        </register>
        <register caption="LIN Baud Rate Register" name="US_LINBRR" offset="0x005C" rw="R" size="4">
          <bitfield caption="Clock Divider after Synchronization" mask="0x0000FFFF" name="LINCD"/>
          <bitfield caption="Fractional Part after Synchronization" mask="0x00070000" name="LINFP"/>
        </register>
        <register caption="LON Mode Register" name="US_LONMR" offset="0x0060" rw="RW" size="4">
          <bitfield caption="LON comm_type Parameter Value" mask="0x00000001" name="COMMT"/>
          <bitfield caption="LON Collision Detection Feature" mask="0x00000002" name="COLDET"/>
          <bitfield caption="Terminate Frame upon Collision Notification" mask="0x00000004" name="TCOL"/>
          <bitfield caption="LON Collision Detection on Frame Tail" mask="0x00000008" name="CDTAIL"/>
          <bitfield caption="LON DMA Mode" mask="0x00000010" name="DMAM"/>
          <bitfield caption="LON Collision Detection Source" mask="0x00000020" name="LCDS"/>
          <bitfield caption="End of Frame Condition Size" mask="0x00FF0000" name="EOFS"/>
        </register>
        <register caption="LON Preamble Register" name="US_LONPR" offset="0x0064" rw="RW" size="4">
          <bitfield caption="LON Preamble Length" mask="0x00003FFF" name="LONPL"/>
        </register>
        <register caption="LON Data Length Register" name="US_LONDL" offset="0x0068" rw="RW" size="4">
          <bitfield caption="LON Data Length" mask="0x000000FF" name="LONDL"/>
        </register>
        <register caption="LON L2HDR Register" name="US_LONL2HDR" offset="0x006C" rw="RW" size="4">
          <bitfield caption="LON Backlog Increment" mask="0x0000003F" name="BLI"/>
          <bitfield caption="LON Alternate Path Bit" mask="0x00000040" name="ALTP"/>
          <bitfield caption="LON Priority Bit" mask="0x00000080" name="PB"/>
        </register>
        <register caption="LON Backlog Register" name="US_LONBL" offset="0x0070" rw="R" size="4">
          <bitfield caption="LON Node Backlog Value" mask="0x0000003F" name="LONBL"/>
        </register>
        <register caption="LON Beta1 Tx Register" name="US_LONB1TX" offset="0x0074" rw="RW" size="4">
          <bitfield caption="LON Beta1 Length after Transmission" mask="0x00FFFFFF" name="BETA1TX"/>
        </register>
        <register caption="LON Beta1 Rx Register" name="US_LONB1RX" offset="0x0078" rw="RW" size="4">
          <bitfield caption="LON Beta1 Length after Reception" mask="0x00FFFFFF" name="BETA1RX"/>
        </register>
