Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.10.230/samv71b/atdf/ATSAMV71J20B.atdf
    <module name="TPIU" caption="Trace Port Interface Register">
      <register-group name="TPIU" caption="Trace Port Interface Register">
        <register name="SSPSR" offset="0x0" rw="R" size="4" access-size="4" caption="Supported Parallel Port Size Register">
        </register>
        <register name="CSPSR" offset="0x4" rw="RW" size="4" access-size="4" caption="Current Parallel Port Size Register">
        </register>
        <register name="ACPR" offset="0x10" rw="RW" size="4" access-size="4" caption="Asynchronous Clock Prescaler Register">
          <bitfield name="PRESCALER" caption="" mask="0x1FFF"/>
        </register>
        <register name="SPPR" offset="0xF0" rw="RW" size="4" access-size="4" caption="Selected Pin Protocol Register">
          <bitfield name="TXMODE" caption="" mask="0x3"/>
        </register>
        <register name="FFSR" offset="0x300" rw="R" size="4" access-size="4" caption="Formatter and Flush Status Register">
          <bitfield name="FlInProg" caption="" mask="0x1"/>
          <bitfield name="FtStopped" caption="" mask="0x2"/>
          <bitfield name="TCPresent" caption="" mask="0x4"/>
          <bitfield name="FtNonStop" caption="" mask="0x8"/>
        </register>
        <register name="FFCR" offset="0x304" rw="RW" size="4" access-size="4" caption="Formatter and Flush Control Register">
          <bitfield name="EnFCont" caption="" mask="0x2"/>
          <bitfield name="TrigIn" caption="" mask="0x100"/>
        </register>
        <register name="FSCR" offset="0x308" rw="R" size="4" access-size="4" caption="Formatter Synchronization Counter Register">
        </register>
        <register name="TRIGGER" offset="0xEE8" rw="R" size="4" access-size="4" caption="TRIGGER">
          <bitfield name="TRIGGER" caption="" mask="0x1"/>
        </register>
        <register name="FIFO0" offset="0xEEC" rw="R" size="4" access-size="4" caption="Integration ETM Data">
          <bitfield name="ETM0" caption="" mask="0xFF"/>
          <bitfield name="ETM1" caption="" mask="0xFF00"/>
          <bitfield name="ETM2" caption="" mask="0xFF0000"/>
          <bitfield name="ETM_bytecount" caption="" mask="0x3000000"/>
          <bitfield name="ETM_ATVALID" caption="" mask="0x4000000"/>
          <bitfield name="ITM_bytecount" caption="" mask="0x18000000"/>
          <bitfield name="ITM_ATVALID" caption="" mask="0x20000000"/>
        </register>
        <register name="ITATBCTR2" offset="0xEF0" rw="R" size="4" access-size="4" caption="ITATBCTR2">
          <bitfield name="ATREADY" caption="" mask="0x1"/>
        </register>
        <register name="ITATBCTR0" offset="0xEF8" rw="R" size="4" access-size="4" caption="ITATBCTR0">
          <bitfield name="ATREADY" caption="" mask="0x1"/>
        </register>
        <register name="FIFO1" offset="0xEFC" rw="R" size="4" access-size="4" caption="Integration ITM Data">
          <bitfield name="ITM0" caption="" mask="0xFF"/>
          <bitfield name="ITM1" caption="" mask="0xFF00"/>
          <bitfield name="ITM2" caption="" mask="0xFF0000"/>
          <bitfield name="ETM_bytecount" caption="" mask="0x3000000"/>
          <bitfield name="ETM_ATVALID" caption="" mask="0x4000000"/>
          <bitfield name="ITM_bytecount" caption="" mask="0x18000000"/>
          <bitfield name="ITM_ATVALID" caption="" mask="0x20000000"/>
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" caption="Integration Mode Control">
          <bitfield name="Mode" caption="" mask="0x1"/>
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="Claim tag set">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="Claim tag clear">
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="TPIU_DEVID">
          <bitfield name="NrTraceInput" caption="" mask="0x1"/>
          <bitfield name="AsynClkIn" caption="" mask="0x20"/>
          <bitfield name="MinBufSz" caption="" mask="0x1C0"/>
          <bitfield name="PTINVALID" caption="" mask="0x200"/>
          <bitfield name="MANCVALID" caption="" mask="0x400"/>
          <bitfield name="NRZVALID" caption="" mask="0x800"/>
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="TPIU_DEVTYPE">
          <bitfield name="SubType" caption="" mask="0xF"/>
          <bitfield name="MajorType" caption="" mask="0xF0"/>
        </register>
      </register-group>
    </module>
    <module name="ETM" caption="Embedded Trace Macrocell">
      <register-group name="ETM" caption="Embedded Trace Macrocell">
        <register name="CR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000411" caption="ETM Main Control Register">
          <bitfield name="ETMPD" caption="ETM Power Down" mask="0x1"/>
          <bitfield name="PORTSIZE" caption="Port Size bits 2:0" mask="0x70"/>
          <bitfield name="STALL" caption="Stall Processor" mask="0x80"/>
          <bitfield name="BROUT" caption="Branch Output" mask="0x100"/>
          <bitfield name="DBGRQ" caption="Debug Request Control" mask="0x200"/>
          <bitfield name="PROG" caption="ETM Programming" mask="0x400"/>
          <bitfield name="PORTSEL" caption="ETM Port Select" mask="0x800"/>
          <bitfield name="PORTMODE2" caption="Port Mode bit 2" mask="0x2000"/>
          <bitfield name="PORTMODE" caption="Port Mode bits 1:0" mask="0x30000"/>
          <bitfield name="PORTSIZE3" caption="Port Size bit 3" mask="0x200000"/>
          <bitfield name="TSEN" caption="TimeStamp Enable" mask="0x10000000"/>
        </register>
        <register name="CCR" offset="0x4" rw="R" size="4" access-size="4" initval="0x8C802000" caption="ETM Configuration Code Register">
        </register>
        <register name="TRIGGER" offset="0x8" rw="RW" size="4" access-size="4" caption="ETM Trigger Event Register">
        </register>
        <register name="SR" offset="0x10" rw="RW" size="4" access-size="4" caption="ETM Status Register">
        </register>
        <register name="SCR" offset="0x14" rw="R" size="4" access-size="4" atomic-op="clear:SR" initval="0x00020D09" caption="ETM System Configuration Register">
        </register>
        <register name="TEEVR" offset="0x20" rw="RW" size="4" access-size="4" caption="ETM TraceEnable Event Register">
        </register>
        <register name="TECR1" offset="0x24" rw="RW" size="4" access-size="4" caption="ETM TraceEnable Control 1 Register">
        </register>
