Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.10.230/samv71b/atdf/ATSAMV71J20B.atdf
        <register name="FFLR" offset="0x28" rw="RW" size="4" access-size="4" caption="ETM FIFO Full Level Register">
        </register>
        <register name="CNTRLDVR1" offset="0x140" rw="RW" size="4" access-size="4" caption="ETM Free-running Counter Reload Value">
        </register>
        <register name="SYNCFR" offset="0x1E0" rw="R" size="4" access-size="4" initval="0x00000400" caption="ETM Synchronization Frequency Register">
        </register>
        <register name="IDR" offset="0x1E4" rw="R" size="4" access-size="4" initval="0x4114F250" caption="ETM ID Register">
        </register>
        <register name="CCER" offset="0x1E8" rw="R" size="4" access-size="4" initval="0x18541800" caption="ETM Configuration Code Extension Register">
        </register>
        <register name="TESSEICR" offset="0x1F0" rw="RW" size="4" access-size="4" caption="ETM TraceEnable Start/Stop EmbeddedICE Control Register">
        </register>
        <register name="TSEVT" offset="0x1F8" rw="RW" size="4" access-size="4" caption="ETM TimeStamp Event Register">
        </register>
        <register name="TRACEIDR" offset="0x200" rw="RW" size="4" access-size="4" initval="0x00000000" caption="ETM CoreSight Trace ID Register">
        </register>
        <register name="IDR2" offset="0x208" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM ID Register 2">
        </register>
        <register name="PDSR" offset="0x314" rw="R" size="4" access-size="4" initval="0x00000001" caption="ETM Device Power-Down Status Register">
        </register>
        <register name="ITMISCIN" offset="0xEE0" rw="R" size="4" access-size="4" caption="ETM Integration Test Miscellaneous Inputs">
        </register>
        <register name="ITTRIGOUT" offset="0xEE8" rw="W" size="4" access-size="4" caption="ETM Integration Test Trigger Out">
        </register>
        <register name="ITATBCTR2" offset="0xEF0" rw="R" size="4" access-size="4" caption="ETM Integration Test ATB Control 2">
        </register>
        <register name="ITATBCTR0" offset="0xEF8" rw="W" size="4" access-size="4" caption="ETM Integration Test ATB Control 0">
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" initval="0x00000000" caption="ETM Integration Mode Control Register">
          <bitfield name="INTEGRATION" caption="" mask="0x1"/>
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="ETM Claim Tag Set Register">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="ETM Claim Tag Clear Register">
        </register>
        <register name="LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="ETM Lock Access Register">
        </register>
        <register name="LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="ETM Lock Status Register">
          <bitfield name="Present" caption="" mask="0x1"/>
          <bitfield name="Access" caption="" mask="0x2"/>
          <bitfield name="ByteAcc" caption="" mask="0x4"/>
        </register>
        <register name="AUTHSTATUS" offset="0xFB8" rw="R" size="4" access-size="4" caption="ETM Authentication Status Register">
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" initval="0x00000013" caption="ETM CoreSight Device Type Register">
        </register>
        <register name="PIDR4" offset="0xFD0" rw="R" size="4" access-size="4" initval="0x00000004" caption="ETM Peripheral Identification Register #4">
        </register>
        <register name="PIDR5" offset="0xFD4" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM Peripheral Identification Register #5">
        </register>
        <register name="PIDR6" offset="0xFD8" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM Peripheral Identification Register #6">
        </register>
        <register name="PIDR7" offset="0xFDC" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM Peripheral Identification Register #7">
        </register>
        <register name="PIDR0" offset="0xFE0" rw="R" size="4" access-size="4" initval="0x00000025" caption="ETM Peripheral Identification Register #0">
        </register>
        <register name="PIDR1" offset="0xFE4" rw="R" size="4" access-size="4" initval="0x000000B9" caption="ETM Peripheral Identification Register #1">
        </register>
        <register name="PIDR2" offset="0xFE8" rw="R" size="4" access-size="4" initval="0x0000000B" caption="ETM Peripheral Identification Register #2">
        </register>
        <register name="PIDR3" offset="0xFEC" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM Peripheral Identification Register #3">
        </register>
        <register name="CIDR0" offset="0xFF0" rw="R" size="4" access-size="4" initval="0x0000000D" caption="ETM Component  Identification Register #0">
        </register>
        <register name="CIDR1" offset="0xFF4" rw="R" size="4" access-size="4" initval="0x00000090" caption="ETM Component  Identification Register #1">
        </register>
        <register name="CIDR2" offset="0xFF8" rw="R" size="4" access-size="4" initval="0x00000005" caption="ETM Component  Identification Register #2">
        </register>
        <register name="CIDR3" offset="0xFFC" rw="R" size="4" access-size="4" initval="0x000000B1" caption="ETM Component  Identification Register #3">
        </register>
      </register-group>
    </module>
    <module name="ICE" caption="In-Circuit Emulator (JTAG/SWD/SWO)"/>
  </modules>
  <pinouts>
    <pinout name="LQFP64">
      <pin position="40" pad="PA3"/>
      <pin position="34" pad="PA4"/>
      <pin position="32" pad="PA5"/>
      <pin position="15" pad="PA7"/>
      <pin position="16" pad="PA8"/>
      <pin position="33" pad="PA9"/>
      <pin position="28" pad="PA10"/>
      <pin position="27" pad="PA11"/>
      <pin position="29" pad="PA12"/>
      <pin position="18" pad="PA13"/>
      <pin position="19" pad="PA14"/>
      <pin position="12" pad="PA21"/>
      <pin position="17" pad="PA22"/>
      <pin position="23" pad="PA24"/>
      <pin position="30" pad="PA27"/>
      <pin position="8" pad="PB0"/>
      <pin position="7" pad="PB1"/>
      <pin position="9" pad="PB2"/>
      <pin position="11" pad="PB3"/>
      <pin position="46" pad="PB4"/>
      <pin position="47" pad="PB5"/>
      <pin position="35" pad="PB6"/>
      <pin position="39" pad="PB7"/>
      <pin position="62" pad="PB8"/>
      <pin position="63" pad="PB9"/>
      <pin position="38" pad="PB12"/>
      <pin position="1" pad="PD0"/>
      <pin position="57" pad="PD1"/>
      <pin position="56" pad="PD2"/>
      <pin position="55" pad="PD3"/>
      <pin position="54" pad="PD4"/>
      <pin position="53" pad="PD5"/>
      <pin position="51" pad="PD6"/>
      <pin position="50" pad="PD7"/>
      <pin position="49" pad="PD8"/>
      <pin position="48" pad="PD9"/>
      <pin position="44" pad="PD10"/>
      <pin position="43" pad="PD11"/>
      <pin position="41" pad="PD12"/>
      <pin position="26" pad="PD21"/>
      <pin position="25" pad="PD22"/>
      <pin position="22" pad="PD24"/>
      <pin position="20" pad="PD25"/>
      <pin position="21" pad="PD26"/>
      <pin position="2" pad="PD31"/>
      <pin position="3" pad="VDDOUT"/>
      <pin position="4" pad="VDDIN"/>
      <pin position="5" pad="VREFP"/>
      <pin position="36" pad="NRST"/>
      <pin position="37" pad="TST"/>
      <pin position="10" pad="VDDIO"/>
      <pin position="42" pad="VDDIO"/>
      <pin position="58" pad="VDDIO"/>
      <pin position="45" pad="JTAGSEL"/>
      <pin position="13" pad="VDDCORE"/>
      <pin position="24" pad="VDDCORE"/>
      <pin position="61" pad="VDDCORE"/>
      <pin position="52" pad="VDDPLL"/>
      <pin position="59" pad="DM"/>
      <pin position="60" pad="DP"/>
      <pin position="6" pad="GND"/>
      <pin position="14" pad="GND"/>
      <pin position="31" pad="GND"/>
      <pin position="64" pad="VDDPLLUSB"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
